app/controllers/storefont_controller.rb

SELECT "products".* FROM "products"  ORDER BY "products"."name" ASC
---
  def index
  	@products = Product.order(:name).all