app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"  ORDER BY "categories"."name" ASC
---
     <%= f.label :category_id %><br>
     <%= f.collection_select :category_id, Category.order(:name), :id, :name, {prompt: "Select a category"}, {class: "form-control"} %>

SELECT "brands".* FROM "brands"  ORDER BY "brands"."name" ASC
---
    <%= f.label :brand_id %><br>
    <%= f.collection_select :brand_id, Brand.order(:name), :id, :name, {prompt: "Select a brand"}, {class: "form-control"} %>